In [1]:
import pandas as pd
import numpy as  np

In [4]:
x= pd.read_excel('data_2.xlsx')

In [5]:
x

   Air and GHG emissionsCarbon dioxide (CO2), Tonnes/capita, 2001 – 2018  ... Unnamed: 6
0                                            LOCATION                     ...      Value
1                                                 IND                     ...        0.8
2                                                 IND                     ...        0.9
3                                                 IND                     ...        0.9
4                                                 IND                     ...        0.9
5                                                 IND                     ...        0.9
6                                                 IND                     ...          1
7                                                 IND                     ...        1.1
8                                                 IND                     ...        1.1
9                                                 IND                     ...        1.2
10                                                IND                     ...        1.3
11                                                IND                     ...        1.3
12                                                IND                     ...        1.4
13                                                IND                     ...        1.5
14                                                IND                     ...        1.6
15                                                IND                     ...        1.6
16                                                IND                     ...        1.6
17                                                IND                     ...        1.6
18                                                IND                     ...        1.7

[19 rows x 7 columns]

In [6]:
x.head()

  Air and GHG emissionsCarbon dioxide (CO2), Tonnes/capita, 2001 – 2018  ... Unnamed: 6
0                                           LOCATION                     ...      Value
1                                                IND                     ...        0.8
2                                                IND                     ...        0.9
3                                                IND                     ...        0.9
4                                                IND                     ...        0.9

[5 rows x 7 columns]

In [7]:
x.drop(columns=['Air and GHG emissionsCarbon dioxide (CO2), Tonnes/capita, 2001 – 2018','Unnamed: 1','Unnamed: 3','Unnamed: 4'], axis=0, inplace=True)

In [9]:
x.drop(columns='Unnamed: 2',axis=0, inplace=True)

In [10]:
x.head()

  Unnamed: 5 Unnamed: 6
0       TIME      Value
1       2001        0.8
2       2002        0.9
3       2003        0.9
4       2004        0.9

In [11]:
x.columns=['year co2 is measured','value']

In [12]:
x

   year co2 is measured  value
0                  TIME  Value
1                  2001    0.8
2                  2002    0.9
3                  2003    0.9
4                  2004    0.9
5                  2005    0.9
6                  2006      1
7                  2007    1.1
8                  2008    1.1
9                  2009    1.2
10                 2010    1.3
11                 2011    1.3
12                 2012    1.4
13                 2013    1.5
14                 2014    1.6
15                 2015    1.6
16                 2016    1.6
17                 2017    1.6
18                 2018    1.7

In [13]:
type(x['value'][9])

float

In [14]:
x.dtypes

year co2 is measured    object
value                   object
dtype: object

In [17]:
x.drop(labels=[0,1,2,3,4,5,6,7], axis=0, inplace=True)

In [19]:
x.drop(labels=8, axis=0, inplace=True)

In [20]:
x

   year co2 is measured value
9                  2009   1.2
10                 2010   1.3
11                 2011   1.3
12                 2012   1.4
13                 2013   1.5
14                 2014   1.6
15                 2015   1.6
16                 2016   1.6
17                 2017   1.6
18                 2018   1.7

In [21]:
x.reset_index(drop=True, inplace=True)

In [22]:
x['value']=x['value'].astype(float)

In [23]:
x.dtypes

year co2 is measured     object
value                   float64
dtype: object

In [25]:
x.to_csv('Air and GHG emissionsCarbon dioxide (CO2)2009_2018.csv')

In [26]:
x.style.set_caption('Air and GHG emissionsCarbon dioxide (CO2), Tonnes/capita, 2001 – 2018')